#+TITLE: README
#+AUTHOR: Rick Neff 
#+EMAIL:  NeffR@byui.edu 
#+DATE: 10 November 2018
#+OPTIONS: H:4 num:nil toc:t \n:nil @:t ::t |:t ^:t *:t TeX:t LaTeX:t ':t |:t
#+OPTIONS: html-postamble:t
#+STARTUP: showeverything entitiespretty

  Remember [[https://firstthreeodds.org/17657741833134731255/creativity.html][Steve Olson]] and [[https://rickneff.github.io/exercises-versus-problems.html][Paul Zietz]]? Here is an excerpt from Steve Olson\rsquo{}s
  book where he introduces Paul Zietz and quotes him on his approach to teaching
  /creative problem solving/, which Paul Zietz believes *can be taught* --- but
  his approach may surprise you!

#+BEGIN_QUOTE
  Paul Zeitz, now a professor of mathematics at the University of San Francisco,
  was a member of the U.S. Olympiad team that competed [in 1974].

  [\dots]

  Zeitz [is] always interested in applying the problem solving he’d done as an
  Olympian in his teaching. So he [developed] a series of tough mathematical
  challenges that his students would work on for extended periods. He found this
  approach often engaged the least talented kids just as much as the most
  talented.

  [\dots]

  He [wrote the book] [[https://www.wiley.com/en-us/The+Art+and+Craft+of+Problem+Solving%252C+3rd+Edition-p-9781119094845][The Art and Craft of Problem Solving]], which was [first]
  published in 1999. It’s a challenging book --- many math Olympians use it to
  prepare for the competition. Zeitz uses it with all the students in his
  classes --- including those studying to be teachers --- often by breaking them
  up into teams and letting them work on specific problems for days at a time.
  “The level of the math is not really an issue,” he says. “My main goal when I
  teach this kind of course is to inspire my students to really think hard. It
  sounds simplistic, but that’s all there is to it. I want to get students used
  to a mindset that a problem that is worth solving is worth pondering for a
* LBT
  A Bus Ticket has six digits (0-9). A ticket is lucky if the first three digits
  sum to the same number as the last three digits. For example, the following
  are all lucky:

  - 000000
  - 999999
  - 123420
  - 961088
    
  How many Lucky Bus Tickets are there?

  Find the answer *without* using brute-force exhaustive search (like the code
  below does):
#+BEGIN_SRC elisp :results silent
  (defun sum-of-digits (n)
    (if (zerop n)
        0
      (+ (mod n 10) (sum-of-digits (/ n 10)))))

  (loop for n from 0 to 999999 
        count (= (sum-of-digits (/ n 1000)) (sum-of-digits (% n 1000))))
#+END_SRC

#+RESULTS:
: 55252
* IPR
  Implement in elisp Pollard's Rho method of factorization (see bigal.jar
  (generated by the "bigal" package)). Compare it with the simplistic
  trial-division method below:

#+BEGIN_SRC elisp :results silent
  (defun factorize (n)
    "A brute-force method to obtain n's
  (standard form, but not CSF) factorization."
    (let ((factors nil)
          (k 0)
          (p 2))
      (while (zerop (% n p))
        (setq n (/ n p)
              k (1+ k)))
      (if (not (zerop k))
          (setq factors (cons (cons p k) factors)))
      (setq p 1)
      (while (<= (* p p) n)
        (setq p (+ p 2)
              k 0)
        (while (zerop (% n p))
          (setq n (/ n p)
                k (1+ k)))
        (if (not (zerop k))
            (setq factors (cons (cons p k) factors))))
      (if (not (= n 1))
          (setq factors (cons (cons n 1) factors)))
      (sort factors (lambda (x y) (< (car x) (car y))))))
#+END_SRC

#+BEGIN_SRC elisp
  (factorize 1203157)
#+END_SRC

#+RESULTS:
: ((641 . 1) (1877 . 1))
